La-guajolota/PSOC-5lp/lcd_7seg/7seg_multiplexado_hardware.cydsn/codegentemp/Control_ceros.h
/*******************************************************************************
* File Name: Control_ceros.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_Control_ceros_H) /* CY_CONTROL_REG_Control_ceros_H */
#define CY_CONTROL_REG_Control_ceros_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} Control_ceros_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    Control_ceros_Write(uint8 control) ;
uint8   Control_ceros_Read(void) ;

void Control_ceros_SaveConfig(void) ;
void Control_ceros_RestoreConfig(void) ;
void Control_ceros_Sleep(void) ; 
void Control_ceros_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define Control_ceros_Control        (* (reg8 *) Control_ceros_Sync_ctrl_reg__CONTROL_REG )
#define Control_ceros_Control_PTR    (  (reg8 *) Control_ceros_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_Control_ceros_H */


/* [] END OF FILE */
